Repository: Victorsitou/disnake
Catalog: docs/locale/*/LC_MESSAGES/discord.po
Languages: es

source: Creating a Bot Account
es: Crear una cuenta Bot

source: In order to work with the library and the Discord API in general, we must first create a Discord Bot account.
es: Para poder trabajar con la librería y la API de Discord en general, primero debemos crear un Bot de Discord

source: Creating a Bot account is a pretty straightforward process.
es: La creación de un Bot es un proceso bastante sencillo.

source: Make sure you're logged on to the `Discord website <https://discord.com>`_.
es: Asegúrate de haber iniciado sesión en la `página de Discord <https://discord.com>`_.

source: Navigate to the `application page <https://discord.com/developers/applications>`_
es: Navegue a la página de aplicación <https://discord.com/developers/applications>`_

source: Click on the "New Application" button.
es: Haga click en el botón "New application".

source: Give the application a name and click "Create".
es: Dé un nombre a la applicación y haz click en "Create"

source: Create a Bot User by navigating to the "Bot" tab and clicking "Add Bot".
es: Cree un usuario de Bot navegando a la pestaña "Bot" y haga click en "Add Bot".

source: Click "Yes, do it!" to continue.
es: Haga click en "Yes, do it!" para continuar.

source: Make sure that **Public Bot** is ticked if you want others to invite your bot.
es: Asegúrese de que **Public Bot** esté marcado si quiere que otros inviten a su bot.

source: You should also make sure that **Require OAuth2 Code Grant** is unchecked unless you are developing a service that needs it. If you're unsure, then **leave it unchecked**.
es: También debe asegurarse de que **Require OAuth2 Code Grant** esté desmarcado a menos que esté desarollando un servicio que lo necesite. Si no está seguro, entonces **déjelo desmarcado**.

source: Copy the token using the "Copy" button.
es: Copie el token utilizando el botón "Copy".

source: **This is not the Client Secret at the General Information page.**
es: **Esto no es el Cliente Secreto de la página de información general.**

source: It should be worth noting that this token is essentially your bot's password. You should **never** share this with someone else. In doing so, someone can log in to your bot and do malicious things, such as leaving servers, ban all members inside a server, or pinging everyone maliciously.
es: Vale la pena señalar que este token esencialmente la contraseña de tu bot. Nunca debe compartirla con otra persona. Al hacerlo, alguien puede entrar en tu bot y hacer cosas maliciosas, como salir de los servidores, banear a todos los miembros dentro de un servidor, o etiquetar a todos maliciosamente.

source: The possibilities are endless, so **do not share this token.**
es: Las posibilidades son infinitas, así que **no compartas este token.**

source: If you accidentally leaked your token, click the "Regenerate" button as soon as possible. This revokes your old token and re-generates a new one. Now you need to use the new token to login.
es: Si accidentalmente ha filtrado su token, haga click en el botón "Regenerar" tan pronto como sea posible. Esto elimina su antiguo token y vuelve a generar otro. Ahora tiene que usar su nuevo token para iniciar sesión en su bot.

source: And that's it. You now have a bot account and you can login with that token.
es: Y eso es todo. Ahora tiene un Bot de Discord y puede iniciar sesión con su token.

source: Inviting Your Bot
es: Invitar su Bot.

source: So you've made a Bot User but it's not actually in any server.
es: Así que has hecho un Usuario Bot, pero realmente no está en ningún servidor.

source: If you want to invite your bot you must create an invite URL for it.
es: Si quiere invitar a su Bot debe crear un URL de invitación para el Bot.

source: Click on your bot's page.
es: Haga click en la página de su bot.

source: Go to the "OAuth2" tab.
es: Vaya a la pestaña "OAuth2"

source: Tick the "bot" checkbox under "scopes".
es: Marque la casilla "bot" en "scopes".

source: Tick the permissions required for your bot to function under "Bot Permissions".
es: Marque los permisos necesarios para que su bot funcione en "Bot Permissions".

source: Please be aware of the consequences of requiring your bot to have the "Administrator" permission.
es: Tenga en cuenta las consecuencias de solicitar a tu bot el permiso de "Administrador".

source: Bot owners must have 2FA enabled for certain actions and permissions when added in servers that have Server-Wide 2FA enabled. Check the `2FA support page <https://support.discord.com/hc/en-us/articles/219576828-Setting-up-Two-Factor-Authentication>`_ for more information.
es: Los propietarios de bots deben tener 2FA habilitado para ciertas acciones y permisos cuando se añaden en servidores que tienen el nivel 2FA habilitado. Consulte la `página de soporte de 2FA https://support.discord.com/hc/en-us/articles/219576828-Setting-up-Two-Factor-Authentication>`_ para más información.

source: Now the resulting URL can be used to add your bot to a server. Copy and paste the URL into your browser, choose a server to invite the bot to, and click "Authorize".
es: Ahora el URL resultante puede ser usado para añadir tu bot a un servidor. Copie y pegue el URL en su navegador, elija un servidor y dé click en "Autorizar"

source: The person adding the bot needs "Manage Server" permissions to do so.
es: La persona que añada el bot necesita el permiso "Gestionar Servidor" para hacerlo.

source: If you want to generate this URL dynamically at run-time inside your bot and using the :class:`disnake.Permissions` interface, you can use :func:`disnake.utils.oauth_url`.
es: Si quiere generar este URL dinámicamente en el momento de ejecución de su bot y utilizando la interfaz :class:`disnake.Permissions`, usted puede utilizar :func:`disnake.utils.oauth_url`.
