Repository: Victorsitou/disnake
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: es

source: Quickstart
es: Inicio rápido

source: This page gives a brief introduction to the library. It assumes you have the library installed, if you don't check the :ref:`installing` portion.
es: Esta página proporciona una breve introducción a la librería. Se asume que tiene la librería instalada, si no es así, eche un vistazo a la sección de :ref:`installing`.

source: A Minimal Bot
es: Un pequeño Bot

source: Let's make a bot that responds to a specific message and walk you through it.
es: Vamos a guiarte a crear un bot que responda a un mensaje específico.

source: It looks something like this:
es: Se ve algo así:

source: Let's name this file ``example_bot.py``. Make sure not to name it ``disnake`` as that'll conflict with the library.
es: Llamemos a este archivo ``example_bot.py``. Asegúrate de no llamarlo ``disnake``, ya que tendrá conflictos con la librería.

source: There's a lot going on here, so let's walk you through it step by step.
es: Hay muchas cosas que hacer aquí, así que vamos a explicarlo paso a paso.

source: The first line just imports the library, if this raises a `ModuleNotFoundError` or `ImportError` then head on over to :ref:`installing` section to properly install.
es: La primera línea importa la librería, si esto genera un error `ModuleNotFoundError` o `ImportError`, entonces diríjase a la sección de :ref:`installing` para instalarlo correctamente.

source: Next, we create an instance of a :class:`Client`. This client is our connection to Discord.
es: A continuación, creamos una instancia de un :class:`Client`. Este cliente es nuestra conexión a Discord.

source: We then use the :meth:`Client.event` decorator to register an event. This library has many events. Since this library is asynchronous, we do things in a "callback" style manner.
es: Luego utilizamos el decorador :meth:`Client.event` para registrar un evento. Esta librería tiene muchos eventos. Como esta librería es asíncrona, hacemos las cosas al estilo "callback"

source: A callback is essentially a function that is called when something happens. In our case, the :func:`on_ready` event is called when the bot has finished logging in and setting things up and the :func:`on_message` event is called when the bot has received a message.
es: Un callback es esencialmente una función que es llamada cuando algo sucede. En nuestro caso, el evento :func:`on_ready` es llamado cuando el bot ha terminado de iniciar sesión y de configurar todo, y el evento :func:`on_message` es llamado cuando el bot ha recibido un mensaje.

source: Since the :func:`on_message` event triggers for *every* message received, we have to make sure that we ignore messages from ourselves. We do this by checking if the :attr:`Message.author` is the same as the :attr:`Client.user`.
es: Dado que el evento :func:`on_message` se ejecuta para *cada* mensaje recibido, tenemos que asegurarnos de que ignoramos los mensajes de nosotros mismos. Lo hacemos comprobando si :attr:`Message.author` es el mismo que el :attr:`Client.user`.

source: Afterwards, we check if the :class:`Message.content` starts with ``'$hello'``. If it does, then we send a message in the channel it was used in with ``'Hello!'``. This is a basic way of handling commands, which can be later automated with the :doc:`./ext/commands/index` framework.
es: Después, comprobamos si el :class:`Message.content` empieza con ``'$hello'``. Si es así, entonces enviamos un mensaje en el canal en el que se utilizó con ``Hello!``. Esta es una forma básica de manejar los comandos, que puede ser automatizada posteriormente con el framework :doc:`./ext/commands/index`.

source: Finally, we run the bot with our login token. If you need help getting your token or creating a bot, look in the :ref:`discord-intro` section.
es: Finalmente, ejecutamos el bot con nuestro token de acceso. Si necesita ayuda para conseguir su token o crear un bot, eche un vistazo a la sección :ref:`discord-intro`.

source: Now that we've made a bot, we have to *run* the bot. Luckily, this is simple since this is just a Python script, we can run it directly.
es: Ahora que hemos creado un bot, tenemos que *ejecutar* el bot. Por suerte esto es simple, ya que se trata de un script de Python, podemos ejecutarlo directamente.

source: On Windows:
es: En Windows:

source: On other systems:
es: En otros sistemas operativos:

source: Now you can try playing around with your basic bot.
es: Ahora puede probar a jugar con su bot básico.
